In [1]:
import pandas as pd

def load_csv(file_path):
    return pd.read_csv(file_path)

food = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_foods.csv"
rw1s = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_1_sales.csv"
rw2s = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_2_sales.csv"
rw1t = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_week_1_times.csv"
rcust = r"C:\Users\User\Downloads\SBA-class-activity-main\restaurant_customers.csv"

food_data = load_csv(food)
print('FOOD')
display(food_data.head(5))

res_w1_sales = load_csv(rw1s)
print('WEEK 1 SALES')
display(res_w1_sales.head(5))

res_w2_sales = load_csv(rw2s)
print('WEEK 2 SALES')
display(res_w2_sales.head(5))

customer_data = load_csv(rcust)
print('CUSTOMERS')
display(customer_data.head(5))

res_w1_time = load_csv(rw1t)
print('WEEK 1 TIME')
display(res_w1_time.head(5))

FOOD

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49

WEEK 1 SALES

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

WEEK 2 SALES

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

CUSTOMERS

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive
3   4     Steven     Evans    Male     Fatz               Registered Nurse
4   5       Judy  Morrison  Female  Demivee                Legal Assistant

WEEK 1 TIME

  Time of Day
0    14:54:59
1    20:55:17
2    01:16:22
3    16:17:26
4    19:26:11

In [2]:
res_w2_sales.merge(customer_data, how='left', left_on='Customer ID', right_on='ID')

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [4]:
res_w2_sales.merge(customer_data, how='left', left_on='Customer ID', right_on='ID').drop('ID', axis='columns')

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [9]:
res_w2_sales.merge(customer_data, how='inner', left_on='Customer ID', right_on='ID').drop('ID', axis='columns')

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

### Inner Join

It combines rows from both dataframes only when there are matching values in a specified common column (or index).

In [16]:
res_w1_sales[res_w1_sales['Customer ID'] == 155]

    Customer ID  Food ID
4           155        9
17          155        1

In [17]:
res_w2_sales[res_w2_sales['Customer ID'] == 155]

     Customer ID  Food ID
208          155        3

### Finding the changes in sales with merge function

In [23]:
res_w1_sales.merge(res_w2_sales, how='inner', on='Customer ID', suffixes=[' - Week 1', ' - Week 2'])

    Customer ID  Food ID - Week 1  Food ID - Week 2
0           537                 9                 5
1           155                 9                 3
2           503                 5                 8
3           503                 5                 9
4           155                 1                 3
..          ...               ...               ...
57          945                 5                 4
58          343                 3                 5
59          343                 3                 2
60          343                 3                 7
61          621                 9                 6

[62 rows x 3 columns]

### Merging two dataframes with common columns

In [24]:
res_w1_sales.merge(res_w2_sales, how='inner', on=['Customer ID', 'Food ID'])

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5          922        1
6           21        4
7          578        5
8          578        5

### Conditional Formatting

In [33]:
condition_one = res_w1_sales['Customer ID'] == 578
condition_two = res_w1_sales['Food ID'] == 5

res_w1_sales[condition_one & condition_two]

     Customer ID  Food ID
224          578        5

In [35]:
condition_one = res_w2_sales['Customer ID'] == 578
condition_two = res_w2_sales['Food ID'] == 5

res_w1_sales[condition_one & condition_two]

     Customer ID  Food ID
29           680        9
189          501        6